type 로그인_퍼널_Key = '로그인' | '닉네임_설정';

const 로그인_퍼널: Record<로그인_퍼널_Key, string> = {
  로그인: '/login',
  닉네임_설정: 'login?step=닉네임_설정',
};

type 다짐_생성_퍼널_Key =
  | '다짐_입력'
  | '기프티콘_업로드'
  | '다짐_시작일'
  | '다짐_등록_확인'
  | '다짐_등록_완료';

const 다짐_생성_퍼널: Record<다짐_생성_퍼널_Key, string> = {
  다짐_입력: '/add',
  기프티콘_업로드: '/add?step=기프티콘_업로드',
  다짐_시작일: '/add?step=다짐_시작일',
  다짐_등록_확인: '/add?step=다짐_등록_확인',
  다짐_등록_완료: '/add?step=다짐_등록_완료',
};

const 다짐_도전_퍼널 = {
  다짐_도전: '/',
};

export default { 로그인_퍼널, 다짐_생성_퍼널, 다짐_도전_퍼널 };
